
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Талончик.ПолучитьМакет("Печать1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Талончик.НомерКабинета,
	|	Талончик.НомерТалона,
	|	Талончик.Стоматолог,
	|	Талончик.ФИОПациента,
	|	Талончик.ДатаИВремя.(
	|		Дата,
	|		Время
	|	)
	|ИЗ
	|	Документ.Талончик КАК Талончик
	|ГДЕ
	|	Талончик.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДатаИВремяШапка = Макет.ПолучитьОбласть("ДатаИВремяШапка");
	ОбластьДатаИВремя = Макет.ПолучитьОбласть("ДатаИВремя");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДатаИВремяШапка);
		ВыборкаДатаИВремя = Выборка.ДатаИВремя.Выбрать();
		Пока ВыборкаДатаИВремя.Следующий() Цикл
			ОбластьДатаИВремя.Параметры.Заполнить(ВыборкаДатаИВремя);
			ТабДок.Вывести(ОбластьДатаИВремя, ВыборкаДатаИВремя.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
