
Процедура Чек(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Чек)
	Макет = Документы.ЗаписьПациента.ПолучитьМакет("Чек");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаписьПациента.ВремяПриема,
	|	ЗаписьПациента.ДатаПриема,
	|	ЗаписьПациента.Номер,
	|	ЗаписьПациента.ПринимающийСтоматолог,
	|	ЗаписьПациента.ФИО,
	|	ЗаписьПациента.НужныеУслуги.(
	|		НужнаяУслуга,
	|		Цена1,
	|		ДополнительнаяУслуга,
	|		Цена2,
	|		ДополнительнаяУслуга2,
	|		Цена3,
	|		СуммаКОплате
	|	)
	|ИЗ
	|	Документ.ЗаписьПациента КАК ЗаписьПациента
	|ГДЕ
	|	ЗаписьПациента.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьНужныеУслугиШапка = Макет.ПолучитьОбласть("НужныеУслугиШапка");
	ОбластьНужныеУслуги = Макет.ПолучитьОбласть("НужныеУслуги");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьНужныеУслугиШапка);
		ВыборкаНужныеУслуги = Выборка.НужныеУслуги.Выбрать();
		Пока ВыборкаНужныеУслуги.Следующий() Цикл
			ОбластьНужныеУслуги.Параметры.Заполнить(ВыборкаНужныеУслуги);
			ТабДок.Вывести(ОбластьНужныеУслуги, ВыборкаНужныеУслуги.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
