Функция Оклад(Должность) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолжностьИОклад.Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.ДолжностьИОклад КАК ДолжностьИОклад
		|ГДЕ
		|	ДолжностьИОклад.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность",Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Оклад;
	КонецЕсли;;
КонецФункции

Функция Премия(ВидПремии) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидПремииИПремия.Премия КАК Премия
		|ИЗ
		|	РегистрСведений.ВидПремииИПремия КАК ВидПремииИПремия
		|ГДЕ
		|	ВидПремииИПремия.ВидПремии = &ВидПремии";
	
	Запрос.УстановитьПараметр("ВидПремии",ВидПремии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.Премия;
	КонецЕсли;;
КонецФункции