

&НаКлиенте
  Процедура НужныеУслугиНужнаяУслугаПриИзменении(Элемент)
	  // Вставить содержимое обработчика.                   
	  СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена1 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.НужнаяУслуга);  
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры

&НаКлиенте
  Процедура НужныеУслугиДополнительнаяУслугаПриИзменении(Элемент)
	         СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена2 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.ДополнительнаяУслуга);
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры

&НаКлиенте
  Процедура НужныеУслугиДополнительнаяУслуга2ПриИзменении(Элемент)
	 СТЧ = Элементы.НужныеУслуги.ТекущиеДанные;
	  СТЧ.Цена3 = РаботаСоСправочниками.РозничкаяЦена(ТекущаяДата(),СТЧ.ДополнительнаяУслуга2);
	  
	  СТЧ.СуммаКОплате = СТЧ.Цена1 + СТЧ.Цена2 + СТЧ.Цена3;
  КонецПроцедуры
                           