 &НаСервере 
 Процедура ПриСозданииНаСервере (Отказ, СтандартнаяОбработка) 
	 //Вставить содержимое обработчика 
	 ЗаполнитьпланировщикНаСервере();
 КонецПроцедуры 
 
Процедура ЗаполнитьпланировщикНаСервере();
Запрос = Новый Запрос;
Запрос.Текст ="ВЫБРАТЬ
| ПриемПац.Прием КАК Прием,
| ПриемПац.Врач КАК Врач,
| ПриемПац.ДатаВремяС КАК ДатаВремяС,
| ПриемПац.ДатаВремяПо КАК ДатаВремяПо
|ИЗ
| РегистрСведений.ПриемПац КАК ПриемПац";
РезультатЗапроса = Запрос.Выполнить();
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
		ЭлементНов=Планировщик.Элементы.Добавить(Выборка.ДатаВремяС,Выборка.ДатаВремяПо);
		ЭлементНов.Текст=Выборка.Врач;
		Сообщить(ЭлементНов.Текст);
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
КонецЦикла;

КонецПроцедуры 
	
	
 